docs/docker-compose/README.md
```mermaid
graph TB

subgraph "Docker Compose (community)"
  direction TB
  Client("👥 Users")
  proxy("Traefik reverse proxy")
  acs("Alfresco Content Services")
  ass("Alfresco Search Services")
  pg[("PostgreSQL")]
  amq[("ActiveMQ")]
  tcore("Transform Core (AIO)")

  acc("Alfresco Control Center")
  share("Alfresco Share")
  aca("Alfresco Content App")
end

Client --> proxy

proxy --> acc
proxy --> share
proxy --> aca
proxy --> acs

acs --> ass
acs --> pg
acs --> tcore
acs --> amq
share --> acs

```
