docs/docker-compose/README.md
```mermaid
graph TB

subgraph "Docker Compose (enterprise)"
  direction TB
  Client("👥 Users")
  proxy("Traefik reverse proxy")
  acs("Alfresco Content Services")
  sync("Alfresco Sync Service")
  aas("Alfresco Audit Storage")
  kib("Kibana")

  subgraph "Alfresco Transform Service"
    trouter("Transform Router")
    sfs("Shared File Store")
    tcore("Transform Core (AIO)")
  end

  subgraph "Alfresco Search Enterprise"
    aser("Reindexing")
    ase("Live Indexing")
  end

  subgraph "Webapps"
    acc("Alfresco Control Center")
    adw("Alfresco Digital Workspace")
    share("Alfresco Share")
  end

  subgraph "Persistence"
    pg[("PostgreSQL")]
    es[("Elasticsearch")]
    amq[("ActiveMQ")]
  end
end

Client --> proxy

proxy --> acc
proxy --> share
proxy ---> adw
proxy ---> acs
proxy ----> sync

aas --> es
aas --> amq
kib --> es

ase --> es
ase --> amq
aser --> pg
aser --> es

acs ---> es
acs ---> pg
acs ---> amq
acs ---> trouter

trouter --> tcore
trouter --> sfs
trouter --> amq

share --> acs

sync --> acs
sync --> pg
sync --> amq
```
